// JavaScript code 
function search() { 
	let input = document.getElementById('searchbar').value 
	input=input.toLowerCase(); 
	let x = document.getElementsByClassName('bookname'); 
	let groub= document.getElementsByClassName('pic-book')
	for (i = 0; i < x.length; i++) { 
		if (!x[i].innerHTML.toLowerCase().includes(input)) { 
			// x[i].style.display="none"; 
			groub[i].style.display="none"; 
		} 
		else { 
			// x[i].style.display="";	
			groub[i].style.display=""; 			 
		} 
	} 
} 
function inputImg(idimg){
	let names=['موت اللورد ادجوير','ثم لم يبق أحد','جثة في المكتبة','قطار الشرق السريع','الحصان الأشهب','مقتل روجر أكرويد','شرخ في المرآة','جريمة في وادي النيل'];
	let photos = ['../../assets/images/lord.jpg', '../../assets/images/none.jpg', '../../assets/images/lib.jpg', '../../assets/images/train.jpg', '../../assets/images/horse.jpg', '../../assets/images/Rogerackroyd.jpg', '../../assets/images/mirror.png', '../../assets/images/neil.jpg'];
	let dicriptions = ['                    .تطلب ممثلة أمريكية متزوجة من اللورد إدجوير من بوارو مساعدتها لتتطلق من زوجها. يوافق بوارو على مساعدتها، ويقابل زوجها. تظهر الممثلة في ذلك المساء في عشاء مع ثلاثة عشر ضيفًا، وهناك خرافة حول ذلك الأمر. يُعثَر في اليوم التالي على اللورد إدجوير وممثلة أمريكية أخرى مقتولين، كلٌ في منزله. يحقق بوارو في ذلك.',
					'عشرة أشخاص لا يجمعهم أي قاسم مشترك ولا انسجام بينهم اجتذبتهم دعوة غامضة إلى جزيرة مقفرة معزولة. وفجأة خلال تناول العشاء دوى تسجيل للمضيف المجهول متهماً كل واحد من الحضور بارتكاب جريمة ',
					'كانت السيدة بانتري مستغرقة في أحلام اليقظة كعادتها كلما نهضت من النوم صباحاً، حيث سمعت فجأة أصواتاً غير مألوفة في جوانب القصر الكبير، ووقع أقدام سريعة، لا عهد لها بها، ثم طرقاً سريعاً على باب مخدعها، وصوت خادمتها تقول في فزع سيدتي، توجد جثة في غرفة المكتبة!!',
						'تحكى هذه الرواية جريمة وقعت في قطار ” طوروس السريع ” كما يسمونة هذا القطار الذى يتكون من عربة مطعم ومطبخ وعربة نوم وعربتين أخريين . والذى يربط بين لندن وتركيا مروراً ،إذ يتم العثور على جثة أحد الركاب داخل مقصورتة الخاصة به ، وقد تلقى هذا القتيل اثنتا عشرة طعنة ، والغريب أن باب مقصورتة كان مغلق من الداخل مما يثير الأمر حيرة ، وهنا وفي هذا الوقت يظهر المحقق بوارو لكى يعمل على هذه الجريمة المستحيلة اذا أن وجوده كان بمحض المصادفة لركوبه هذا القطار ',
					'ضحايا ماتوا بإرادتهم الحرة... لا بل لقد نُميت بذور الضعف الجسدي الموجودة فيهم بواسطة ما يسمى بالوسائل السيكولوجية حيث يتم تحفيز "رغبة الموت" الموجودة لدى كل شخص مما يدفعه إلى الانتحار بملء رغبته ودون أي دوافع أخرى خارجية،                    ولكن ما هو الدافع من وراء استغلال نقاط ضعف النفس البشرية بأبشع صورها؟',
					'تبدأ أحداث الرواية بوفاة السيدة فيرارز، وهي أرملة ثرية، انتحاراً، بسبب الابتزاز الذي يُمارسه ضدها شخص يعرف بأنها قتلت زوجها، وقبل أنتحارها تُرسل رسالة لروجر أكرويد الذي كان قد تقدم لخطبتها؛ تخبره فيها باسم الشخص الذي كان يبتزها.                    يُقتل روجر أكرويد ليلة وصول الرسالة، وتدور الشبهات بين جميع المحيطين به، لكن المشتبه به الرئيسي في القضية هو ابنه بالتبني رالف باتون الذي تشير جميع الأدلة إليه.',
					'تُحقق الآنسة ماربل في مقتل هيذر بيدكوك بشراب مسمم في حفلة محلية، ويُعتقد أن المقصد الأساسي لعملية التسميم كان مُضيفة الحفلة الممثلة الأمريكية الشهيرة مارينا غريغ. وبينما تحقق الآنسة ماربل في القضية، تكتشف أسراراً مُظلمة تتعلق بماضي مارينا، وتتعقد خيوط الجريمة بازدياد عدد الضحايا.',
					'الشابة الثرية والجميلة لينيت ريدجواي تقوم بخيانة أعز صديقاتها جاكلين بالفور مع خطيبها سيمون دويلي، ثم ما تلبث أن تتزوج به. العروسان يقرران قضاء شهر العسل، لكن أينما ذهبا تتبعهما المرأة المحطمة القلب جاكلين بالفور، إلى أن يصلا إلى مصر، أين يقيمان في فندق يوجد به المحقق هيركيول بوارو. يستقل بوارو والزوجان الجديدان وملاحقتهما-جاكلين- وعدد من الركاب الآخرين قاطرة بخارية للقيام بجولة في نهر النيل، لكن في إحدى الأيام يتم إيجاد لينيت مقتولة. كل أصابع الاتهام تتجه نحو جاكلين التي تكن حقدا كبيرا لها. لكن "الخلايا الرمادية الصغيرة" لبوارو غير مقنعة بهذا ويقرر التحقيق في القضية لاكتشاف خفاياها'];
	let index = parseInt(idimg);
	let imgDisp=document.getElementById('changehomepage');
	let booktitle=document.getElementById('booktitlehome');
	let bookdiscrib=document.getElementById('bookdiscriptionhome');
	let idSend=document.getElementsByClassName('show_more');
	idSend.id=idimg
	// let s=idSend.style.id;
	imgDisp.src=photos[index];
	booktitle.innerHTML=names[index];
	bookdiscrib.innerHTML=dicriptions[index];
}

function subm(){
let idSend=document.getElementsByClassName('show_more');
let form=document.getElementById('formsend');

	// e.preventDefault();
	const indexsend=(idSend.id);
	if( indexsend !=undefined)
		window.localStorage.setItem('index',indexsend);
	else
		window.localStorage.setItem('index','1');
	
}